# GetInformationLink Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPipePlumbingFixtureFlowServer..::..GetInformationLink Method
IPipePlumbingFixtureFlowServer Interface See Also
---
The method that Revit will invoke to obtain a URL address which provides more information about the server.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
string GetInformationLink()
```

Visual Basic
---
```text
Function GetInformationLink As String
```

Visual C++
---
```text
String^ GetInformationLink()
```

# ### Return Value
The URL providing server information.
# See Also
IPipePlumbingFixtureFlowServer Interface
Autodesk.Revit.DB.Plumbing Namespace